In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

Q1. Write a code to print the data present in the second row of the dataframe, df.

In [2]:
df.iloc[1]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

The main distinction between loc and iloc is: loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

In [3]:
df.iloc[0:2]

        course_name  duration
0      Data Science         2
1  Machine Learning         3

In [4]:
df.loc[0:3,['duration']]

   duration
0         2
1         3
2         6
3         4

Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].
Did you observe any difference in both the outputs? If so then explain it.

In [5]:
new_df = df.reindex(index = [3,0,1,2])
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [6]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [7]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

yes their is a difference
loc is label based.loc returns the row with label 2 so it returned big data
iloc is integer position based. iloc returns row with integer position so it returned machine learning

In [8]:
#Consider the below code to answer further questions:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [9]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.661364  0.117964  0.741180  0.536646  0.834404  0.722506
2  0.045140  0.421982  0.375755  0.233364  0.637308  0.181449
3  0.888551  0.029923  0.972009  0.984691  0.458432  0.483097
4  0.977860  0.655153  0.845776  0.145446  0.950208  0.454126
5  0.783424  0.964434  0.899508  0.206640  0.100625  0.677861
6  0.423861  0.109997  0.411027  0.221627  0.017225  0.333845

Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’

In [10]:
print('mean of each column : \n ' , df1.mean())

mean of each column :
  column_1    0.630033
column_2    0.383242
column_3    0.707542
column_4    0.388069
column_5    0.499700
column_6    0.475481
dtype: float64

In [11]:
print(' standard deviation of column 2 :\n ' , df1['column_2'].std())

 standard deviation of column 2 :
  0.36961854048312226

Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]

In [12]:
df1.loc[2,'column_2'] = 'string'

In [13]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.661364  0.117964  0.741180  0.536646  0.834404  0.722506
2  0.045140    string  0.375755  0.233364  0.637308  0.181449
3  0.888551  0.029923  0.972009  0.984691  0.458432  0.483097
4  0.977860  0.655153  0.845776  0.145446  0.950208  0.454126
5  0.783424  0.964434  0.899508  0.206640  0.100625  0.677861
6  0.423861  0.109997  0.411027  0.221627  0.017225  0.333845

In [14]:
df1['column_2'].mean()

TypeError: unsupported operand type(s) for +: 'float' and 'str'

we are getting errors here because the datatypes in the column_2 is int and we replaced it with string data types. to get the mean of column_2 all data types need to be integer

Q6. What do you understand about the windows function in pandas and list the types of windows
functions?

The window functions in Pandas are used to perform some sort of calculations across a set of rows that are interrelated with the current row. As we know we have aggregate functions in SQL which help us to perform mathematical calculations among the columns of a table, similarly windows functions help us to perform aggregated calculations across various partitions or cross-sections of the data.

pandas supports 4 types of windowing operations:

Rolling window: Generic fixed or variable sliding window over the values.

Weighted window: Weighted, non-rectangular window supplied by the scipy.signal library.

Expanding window: Accumulating window over the values.

Exponentially Weighted window: Accumulating and exponentially weighted window over the values.

Q7. Write a code to print only the current month and year at the time of answering this question.
[Hint: Use pandas.datetime function]

In [ ]:
import datetime
today = datetime.datetime.today()
print(today.strftime('%Y %B'))

Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.

In [ ]:
input_date_1 = input("enter 1st date(YYYY-MM-DD)")
date1 = pd.to_datetime(input_date_1)

input_date_2 = input('enter 2nd date(YYYY_MM_DD)')
date2 = pd.to_datetime(input_date_2)

difference = date2 - date1
print(difference)

Q9. Write a Python program that reads a CSV file containing categorical data and converts a specified
column to a categorical data type. The program should prompt the user to enter the file path, column
name, and category order, and then display the sorted data.

In [18]:
enter_file = input("enter file name")
df = pd.read_csv(enter_file)

column = input("enter column name")
category = input('enter column name').split(',')

df['column'] = pd.Categorical(df[column] , categories= category)

df = df.sort_values(by = column)
df

enter file name https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv
enter column name Survived
enter column name 1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,column
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
519,520,0,3,"Pavlovic, Mr. Stefo",male,32.0,0,0,349242,7.8958,NaN,S,NaN
521,522,0,3,"Vovk, Mr. Janko",male,22.0,0,0,349252,7.8958,NaN,S,NaN
522,523,0,3,"Lahoud, Mr. Sarkis",male,NaN,0,0,2624,7.2250,NaN,C,NaN
524,525,0,3,"Kassem, Mr. Fared",male,NaN,0,0,2700,7.2292,NaN,C,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
546,547,1,2,"Beane, Mrs. Edward (Ethel Clarke)",female,19.0,1,0,2908,26.0000,NaN,S,NaN
215,216,1,1,"Newell, Miss. Madeleine",female,31.0,1,0,35273,113.2750,D36,C,NaN
216,217,1,3,"Honkanen, Miss. Eliina",female,27.0,0,0,STON/O2. 3101283,7.9250,NaN,S,NaN
218,219,1,1,"Bazzani, Miss. Albina",female,32.0,0,0,11813,76.2917,D15,C,NaN
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S,NaN

Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.
The program should do the followingM
I Prompt the user to enter the file path of the CSV file containing the student dataR
I Read the CSV file into a Pandas DataFrameR
I Calculate the mean, median, and mode of the test scores using Pandas toolsR
I Display the mean, median, and mode in a table.
Assume the CSV file contains the following columnsM
I Student ID: The ID of the studentR
I Test Score: The score of the student's test.
Example usage of the program:
Enter the file path of the CSV file containing the student data: student_data.csv
+-----------+--------+
| Statistic | Value |
+-----------+--------+
| Mean | 79.6 |
| Median | 82 |
| Mode | 85, 90 |
+-----------+--------+
Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85
The program should calculate the mean, median, and mode of the test scores and display the results
in a table.

In [62]:
student_data = {'student_id':[1,2,3,4,5,6,7,8,9,10],
       'test_score':[85,90,80,75,85,82,78,85,90,85]}

In [70]:
df = pd.DataFrame(student_data)

In [72]:
df.to_csv('student_data.csv')

In [75]:
pd.read_csv('student_data.csv')

   Unnamed: 0  student_id  test_score
0           0           1          85
1           1           2          90
2           2           3          80
3           3           4          75
4           4           5          85
5           5           6          82
6           6           7          78
7           7           8          85
8           8           9          90
9           9          10          85

In [81]:
file = input('enter file name')
df1 = pd.read_csv(file)

mean= df['test_score'].mean()
median = df['test_score'].median()
mode = df['test_score'].mode()

table = pd.DataFrame({'stats':['mean','median','mode'],
                     'output':[mean,median,mode.tolist()]})
table

enter file name student_data.csv

    stats output
0    mean   83.5
1  median   85.0
2    mode   [85]